"""
Даны две строки строчных латинских символов: строка J и строка S. Символы, входящие в строку J, — «драгоценности», входящие в строку S — «камни». Нужно определить, какое количество символов из S одновременно являются «драгоценностями». Проще говоря, нужно проверить, какое количество символов из S входит в J.
Это разминочная задача, к которой мы размещаем готовые решения. Она очень простая и нужна для того, чтобы вы могли познакомиться с нашей автоматической системой проверки решений. Ввод и вывод осуществляется через файлы, либо через стандартные потоки ввода-вывода, как вам удобнее.
ввод:      вывод:
ab              4
aabbccd
"""
#
# def sum_in_text():
#     with open("input.txt", "r", encoding="UTF-8") as f:
#         j = f.readline().strip()
#         s = f.readline().strip()
#         result = 0
#         for ch in s:
#             if ch in j:
#                 result += 1
#     with open("output.txt", "w", encoding="UTF-8") as f:
#         result = str(result)
#         f.write(result)
#
#
# sum_in_text()

"""
Даны два числа A и B. Вам нужно вычислить их сумму A+B. В этой задаче вам нужно читать из стандартного ввода и выводить ответ в стандартный вывод
Ввод: 2 2      Вывод: 4
"""

# def sum_():
#     data = input().split(" ")
#     return int(data[0]) + int(data[1])
#
# print(sum_())

